SchoolBase/Documents/ПереводВСледующийКласс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ПереводВСледующийКласс</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Преподаватель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Преподаватели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлассНаМоментЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодУчебыС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодУчебыПо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Ученики</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ученик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Ученики</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

SchoolBase/Catalogs/Ученики.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Ученики</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Родители</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>18</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПометкаОВыпуске</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Классы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

SchoolBase/Catalogs/Классы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Классы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Преподаватели</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Класс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Буква</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Буквы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНабора</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

SchoolBase/Documents/ПереводВСледующийКласс/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура КлассПриИзменении(Элемент)
	ОбновлениеИнформации(); 
	Объект.КлассНаМоментЗаписи = Объект.Класс;
КонецПроцедуры

&НаКлиенте
Процедура ГодУчебыСПриИзменении(Элемент)
	ОбновлениеИнформации();
КонецПроцедуры

&НаКлиенте
Процедура ГодУчебыПоПриИзменении(Элемент)
	ОбновлениеИнформации();
КонецПроцедуры

&НаСервере
Процедура ОбновлениеИнформации()
	Если НЕ Объект.ГодУчебыС = Дата('00010101') И 
		НЕ Объект.ГодУчебыПо = Дата('00010101') Тогда
		Объект.Ученики.Очистить();
		МассивДанных = ПолучитьЗаписиРегистра(Объект.Класс);
		Для Каждого Стр Из МассивДанных Цикл 
			СтрокаТЧ = Объект.Ученики.Добавить();
			СтрокаТЧ.Ученик = Стр.Ученики;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры                       

&НаСервере
Функция ПолучитьЗаписиРегистра(Класс)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Ученики.Ссылка КАК Ученики,
	|	Ученики.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Ученики КАК Ученики
	|ГДЕ
	|	Ученики.Класс = &Класс
	|	И Ученики.ПометкаОВыпуске <> Истина"; 
	
	Запрос.УстановитьПараметр("Класс", Класс);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	МассивДанных = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Данные = Новый Структура;
		Данные.Вставить("Ученики",ВыборкаДетальныеЗаписи.Ученики);
		МассивДанных.Добавить(Данные);
	КонецЦикла;
	
	Возврат МассивДанных;
КонецФункции

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	КлассСсылка = Справочники.Классы.НайтиПоНаименованию(Объект.Класс);    
	КлассОбъект = КлассСсылка.ПолучитьОбъект();
	КлассОбъект.Класс = КлассОбъект.Класс + 1;
	КлассОбъект.Наименование = "" + КлассОбъект.Класс + " '" + КлассОбъект.Буква + "'";
	КлассОбъект.Записать();

КонецПроцедуры
